Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
// ============================================================
//  Save calibration data to Preferences
// ============================================================
void saveCalibrationData() {
  preferences.begin("calibration", false);

  // Save pH calibration
  preferences.putFloat("ph_slope", ph_cal.slope);
  preferences.putFloat("ph_offset", ph_cal.offset);
  preferences.putBool("ph_cal", ph_cal.is_calibrated);
  preferences.putInt("ph_points", ph_cal.num_points);
  preferences.putFloat("ph_p1_v", ph_cal.point1_voltage);
  preferences.putFloat("ph_p1_ph", ph_cal.point1_ph);
  preferences.putFloat("ph_p2_v", ph_cal.point2_voltage);
  preferences.putFloat("ph_p2_ph", ph_cal.point2_ph);

  // Save TDS calibration
  preferences.putFloat("tds_slope", tds_cal.slope);
  preferences.putFloat("tds_offset", tds_cal.offset);
  preferences.putBool("tds_cal", tds_cal.is_calibrated);
  preferences.putInt("tds_points", tds_cal.num_points);
  preferences.putFloat("tds_p1_v", tds_cal.point1_voltage);
  preferences.putFloat("tds_p1_tds", tds_cal.point1_tds);
  preferences.putFloat("tds_p2_v", tds_cal.point2_voltage);
  preferences.putFloat("tds_p2_tds", tds_cal.point2_tds);

  preferences.end();

  Serial.println("💾 Calibration data saved to flash!");
}


// ============================================================
//  Calculate two-point calibration (slope & offset)
// ============================================================
void calculateTwoPointCalibration(
  float v1, float val1,   // First point (voltage, value)
  float v2, float val2,   // Second point (voltage, value)
  float &slope,           // Output: calculated slope
  float &offset           // Output: calculated offset
) {
  // Avoid division by zero
  if (abs(v2 - v1) < 0.001) {
    Serial.println("⚠️ Warning: Calibration points too close, using default");
    slope = 1.0;
    offset = 0.0;
    return;
  }

  // Calculate slope: (y2 - y1) / (x2 - x1)
  slope = (val2 - val1) / (v2 - v1);

  // Calculate offset: y = slope * x + offset  →  offset = y - slope * x
  offset = val1 - (slope * v1);

  Serial.printf("   Calculated Slope: %.4f\n", slope);
  Serial.printf("   Calculated Offset: %.4f\n", offset);
}


// ============================================================
//  Convert raw ADC to voltage
// ============================================================
float rawToVoltage(int raw_adc) {
  return (raw_adc / ADC_RESOLUTION) * VREF;
}

// ============================================================
//  Read raw ADC value with averaging
// ============================================================
float readADCAverage(int pin, int samples) {
  long sum = 0;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(pin);
    delay(SAMPLE_DELAY);
  }
  return (float)sum / samples;
}

// ============================================================
//  ★ IMPROVED pH CONVERSION ★
//  Uses two-point calibration (slope + offset)
// ============================================================
float convertToPH(int raw_adc) {
  // Convert ADC to voltage
  float voltage = rawToVoltage(raw_adc);

  // Base pH calculation (theoretical)
  float ph_base = 7.0 - ((voltage - PH_NEUTRAL_VOLTAGE) / PH_VOLTAGE_PER_UNIT);

  // Apply calibration: pH_calibrated = slope * pH_base + offset
  if (ph_cal.is_calibrated) {
    return (ph_cal.slope * ph_base) + ph_cal.offset;
  }

  return ph_base;  // Return uncalibrated if not calibrated
}


// ============================================================
//  ★ IMPROVED TDS CONVERSION ★
//  Uses two-point calibration (slope + offset)
// ============================================================
float convertToTDS(int raw_adc, float temperature) {
  // Convert ADC to voltage
  float voltage = rawToVoltage(raw_adc);

  // Temperature compensation
  float compensationCoefficient = 1.0 + 0.02 * (temperature - 25.0);
  float compensationVoltage = voltage / compensationCoefficient;

  // Base TDS calculation (polynomial formula)
  float tds_base = (133.42 * compensationVoltage * compensationVoltage * compensationVoltage
                    - 255.86 * compensationVoltage * compensationVoltage
                    + 857.39 * compensationVoltage) * 0.5;

  // Apply calibration: TDS_calibrated = slope * TDS_base + offset
  if (tds_cal.is_calibrated) {
    return (tds_cal.slope * tds_base) + tds_cal.offset;
  }

  return tds_base;  // Return uncalibrated if not calibrated
}


// ============================================================
//  ★ IMPROVED pH CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibratePH(float known_ph_value) {
  Serial.println("\n🧪 Starting pH Calibration...");
  Serial.printf("   Target pH: %.2f\n", known_ph_value);
  Serial.printf("   Current calibration points: %d\n", ph_cal.num_points);
  Serial.println("   Taking readings...");

  // Read raw ADC (averaged for stability)
  float raw_adc = readADCAverage(PH_PIN, CALIBRATION_SAMPLES);
  float voltage = rawToVoltage((int)raw_adc);

  // Calculate base pH (without calibration)
  float base_ph = 7.0 - ((voltage - PH_NEUTRAL_VOLTAGE) / PH_VOLTAGE_PER_UNIT);

  Serial.printf("   Raw ADC: %.2f\n", raw_adc);
  Serial.printf("   Voltage: %.3f V\n", voltage);
  Serial.printf("   Base pH (uncalibrated): %.2f\n", base_ph);

  // Determine if this is first or second calibration point
  if (ph_cal.num_points == 0) {
    // First calibration point
    Serial.println("   → Setting as calibration point 1");

    ph_cal.point1_voltage = voltage;
    ph_cal.point1_ph = known_ph_value;
    ph_cal.num_points = 1;

    // Simple one-point calibration: just offset
    ph_cal.slope = 1.0;
    ph_cal.offset = known_ph_value - base_ph;
    ph_cal.is_calibrated = true;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.3f\n", ph_cal.offset);

  } else if (ph_cal.num_points == 1) {
    // Second calibration point - enable two-point calibration
    Serial.println("   → Setting as calibration point 2");

    // Check if pH values are different enough
    if (abs(known_ph_value - ph_cal.point1_ph) < 1.0) {
      Serial.println("⚠️ Warning: Calibration points should be at least 1 pH unit apart!");
      Serial.println("   (Recommended: pH 4 and pH 7, or pH 7 and pH 10)");
    }

    ph_cal.point2_voltage = voltage;
    ph_cal.point2_ph = known_ph_value;
    ph_cal.num_points = 2;

    // Calculate two-point calibration
    // Map voltage range to pH range
    calculateTwoPointCalibration(
      ph_cal.point1_voltage, ph_cal.point1_ph,
      ph_cal.point2_voltage, ph_cal.point2_ph,
      ph_cal.slope, ph_cal.offset
    );

